# Student Prefromance Analysis
    
   **Lifecycle of Machine Learning Project:**<br>
   -Understand the problem statement<br>
   -Data Collection<br>
   -Data checks to perform<br>
   -Exploratory Data Analysis<br>
   -Data preprocessing<br>
   -Model training<br>
   -Choose best Model<br>
   -Deploy the model<br>

## 1.Problem Statement
Determining the influence of gender,ethnicity,parental_background,etc... on the test performance of student and to make perdictions of test result using that factors.

## 2.Understanding the dataset

In [1]:
!pwd

/Users/anushwork/Desktop/Projects/MLBased/Model/E2E/notebook

In [2]:
!ls

Untitled.ipynb stud.csv

In [3]:
import os
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv("stud.csv")

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

<h3>2.1 Data information</h3>
    <p>This data is student test performance dataset which tries to tell the story of <strong>test result and their relation with gender,race/ethnicity,parental_education,etc..</strong></p>
<ul>
    <li>It has <strong>1000 entries and 8 properties.</strong></li>
    <li>It has <strong>no null values.</strong></li>
    <li>Data types : <strong>String : 5 cloumns , Integer : 3 columns.</strong></li>
    <li>Three result column(Integer) :<strong>math_score, reading_score, writing_score.</strong></li>
</ul>
    <p>Data Source:</p>
    <a href="https://www.kaggle.com/datasets/spscientist/students-performance-in-exams?datasetId=74977">Kaggle Link</a>

<h3>2.2 Column information #to add<h3>

## 3.Exploring data

In [ ]:
data.shape

In [11]:
data.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [17]:
data.duplicated().sum()

0

In [20]:
data.isna().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [24]:
data.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

The mean varies between 66 to 69.<br>
The standard deviation is also around 14 and 15.<br>
According to the stats we can infer that marks is given between 0 to 100.

In [35]:
data.select_dtypes(include=object).nunique()

gender                         2
race_ethnicity                 5
parental_level_of_education    6
lunch                          2
test_preparation_course        2
dtype: int64

Let us see the above classes in detail.

In [32]:
for col in data.select_dtypes(include=object).columns:
    print(f"Categorical values in {col}: ",end = " ")
    print(data[col].unique())
    print()

Categorical values in gender:  ['female' 'male']

Categorical values in race_ethnicity:  ['group B' 'group C' 'group A' 'group D' 'group E']

Categorical values in parental_level_of_education:  ["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']

Categorical values in lunch:  ['standard' 'free/reduced']

Categorical values in test_preparation_course:  ['none' 'completed']

### 3.1 Adding the "total_score" and "average_score" column

In [50]:
data['total_score'] = data[["math_score","reading_score","writing_score"]].sum(axis=1)
data['avg_score'] = data['total_score']/3

In [51]:
data.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,avg_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333